kampung_inggris_plus/app/Http/Controllers/LandingPageController.php

select * from `program` order by `id` asc
select * from `galleries` where `status` = 1 order by `created_at` desc
select * from `program_offline` where `is_active` = 1 order by `created_at` desc
select * from `program_online` where `is_active` = 1 order by `created_at` desc
select * from `program_camp` where `program_camp`.`deleted_at` is null order by `id` asc
select * from `sosmed`
select * from `program` where `status` = 'aktif' limit 1
select * from `thumbnails` where `thumbnails`.`program_camp_id` in (1, 2, 3) order by `id` asc
---
    public function index()
    {
        $programs        = Program::orderBy('id', 'asc')->get();
        $galleries       = Gallery::where('status', 1)->with('images')->latest()->get();
        $galeriErfan     = GaleriErfan::where('status', 1)->with('images')->latest()->get();
        $offlinePrograms = ProgramOffline::where('is_active', 1)->latest()->get();
        $onlinePrograms  = ProgramOnline::where('is_active', 1)->latest()->get();
        $camps           = ProgramCamp::orderBy('id', 'asc')->get();
        $sosmed          = Sosmed::all();
        $contactServices = Customer_Service::all();
        $programsgambar = Program::where('status', 'aktif')->first();

        // Kelompokkan berdasarkan platform sosial media
        $groupedSosmed = [
            'YouTube'   => [],
            'Instagram' => [],
            'Facebook'  => [],
            'TikTok'    => [],
        ];


        $camps = ProgramCamp::with(['thumbnails' => function ($q) {
            $q->orderBy('id', 'asc'); // ambil urutan pertama
        }])->orderBy('id', 'asc')->get();