kampung_inggris_plus/app/Http/Controllers/PendaftranCampController.php

    public function store(Request $request, ProgramCamp $program)
    {
        $validated = $request->validate([
            'nama_lengkap'   => 'required|string|max:255',
            'email'          => 'required|email|max:255',
            'no_hp'          => 'required|string|max:20',
            'asal_kota'      => 'required|string|max:100',
            'period_id'      => 'required|exists:periods,id',
            'durasi_paket'   => 'required|in:perhari,satu_minggu,dua_minggu,tiga_minggu,satu_bulan,dua_bulan,tiga_bulan,enam_bulan,satu_tahun',
            'gender'         => 'required|in:putra,putri',
            'payment_type' => 'required|in:tunai,nontunai',
            'bank_id'      => 'nullable|required_if:payment_type,nontunai|exists:banks,id',
        ], [
            'bank_id.required_if' => 'Bank harus dipilih jika metode pembayaran non tunai.',
        ]);

        // Cek stok terlebih dahulu
        if ($program->stok <= 0) {
            return redirect()->back()->with('error', 'Stok program camp sudah habis!');
        }

        // Buat trx_id
        $prefix = 'TRXC-' . now()->format('Ymd') . '-';
        $last = PendaftaranProgramCamp::where('trx_id', 'like', $prefix . '%')
            ->orderBy('id', 'desc')
            ->first();
---
select * from `pendaftaran_program_camp` where `trx_id` like 'TRXC-20250902-%' order by `id` desc limit 1



        // Simpan pendaftaran
        $pendaftaran = PendaftaranProgramCamp::create([
            'nama_lengkap'     => $validated['nama_lengkap'],
            'email'            => $validated['email'],
            'no_hp'            => $validated['no_hp'],
            'asal_kota'        => $validated['asal_kota'],
            'gender'           => $validated['gender'],
            'program_camp_id'  => $program->id,
            'period_id'        => $validated['period_id'],
            'durasi_paket'     => $validated['durasi_paket'],
            'bank_id'          => $validated['bank_id'],
            'payment_type'     => $validated['payment_type'],
            'status'           => 'pending',
            'nama_kamar'       => null,
            'trx_id'           => $trx_id,
        ]);
---
insert into `pendaftaran_program_camp` (`nama_lengkap`, `email`, `no_hp`, `asal_kota`, `gender`, `program_camp_id`, `period_id`, `durasi_paket`, `bank_id`, `payment_type`, `status`, `nama_kamar`, `trx_id`, `updated_at`, `created_at`) values ('Edward Landung Pramudya', 'edwardlpramudya2005@gmail.com', '082131270114', 'Jember', 'putra', 1, '1', 'perhari', null, 'tunai', 'pending', null, 'TRXC-20250901-1', '2025-09-01 21:30:07', '2025-09-01 21:30:07')


        $programcamp = $pendaftaran->program->nama ?? 'Tidak ada program';
        $line = str_repeat('-', 64);
        $period = Period::find($pendaftaran->period_id);
---
select * from `periods` where `periods`.`id` = '1' and `periods`.`deleted_at` is null limit 1

    public function halamanKamar($trx_id)
    {
        $pendaftar = PendaftaranProgramCamp::where('trx_id', $trx_id)->firstOrFail();
        $rooms = Rooms::where('program_camp_id', $pendaftar->program_camp_id)->get();

        // Ambil semua pendaftar di program camp ini
        $allPendaftar = PendaftaranProgramCamp::whereNotNull('room_id')
            ->where('program_camp_id', $pendaftar->program_camp_id)
            ->get();
---
select * from `pendaftaran_program_camp` where `trx_id` = 'TRXC-20250902-5' limit 1
select * from `rooms` where `program_camp_id` = 1
select * from `pendaftaran_program_camp` where `room_id` is not null and `program_camp_id` = 1